cobiansm/frdm-mcxn947-state-machine/frdmrw612_SmartLock_FinalProject/source/app.c
/*
 * Copyright (c) 2015 - 2016, Freescale Semiconductor, Inc.
 * Copyright 2016 - 2017 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

//TODO DSOAE The these task requires to be completed:
													//USB_HostApplicationKeyboardTask
													//tcpipserver_task
													//database_task
													//servo_task

#include "usb_host_config.h"
#include "usb_host.h"
#include "fsl_device_registers.h"
#include "usb_host_hid.h"
#include "host_keyboard_mouse.h"
#include "host_keyboard.h"
#include "fsl_common.h"
#include "board.h"
#if (defined(FSL_FEATURE_SOC_SYSMPU_COUNT) && (FSL_FEATURE_SOC_SYSMPU_COUNT > 0U))
#include "fsl_sysmpu.h"
#endif /* FSL_FEATURE_SOC_SYSMPU_COUNT */
#include "app.h"

#if ((!USB_HOST_CONFIG_KHCI) && (!USB_HOST_CONFIG_EHCI) && (!USB_HOST_CONFIG_OHCI) && (!USB_HOST_CONFIG_IP3516HS))
#error Please enable USB_HOST_CONFIG_KHCI, USB_HOST_CONFIG_EHCI, USB_HOST_CONFIG_OHCI, or USB_HOST_CONFIG_IP3516HS in file usb_host_config.
#endif

#include "lwip/opt.h"
#include "lwipopts_gen.h"
#include "lwip/dhcp.h"
#include "lwip/ip_addr.h"
#include "lwip/netifapi.h"
#include "lwip/prot/dhcp.h"
#include "lwip/tcpip.h"
#include "lwip/sys.h"
#include "ethernetif.h"
#include "semphr.h"

#include "fsl_adapter_gpio.h"

#include "pin_mux.h"
#include "fsl_phy.h"

#ifndef configMAC_ADDR
#include "fsl_silicon_id.h"
#endif

#include "servo_task.h"
#include "database_task.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/
#ifndef EXAMPLE_NETIF_INIT_FN
/*! @brief Network interface initialization function. */
#define EXAMPLE_NETIF_INIT_FN ethernetif0_init
#endif /* EXAMPLE_NETIF_INIT_FN */

/*! @brief Stack size of the temporary lwIP initialization thread. */
#define INIT_THREAD_STACKSIZE 1024

/*! @brief Priority of the temporary lwIP initialization thread. */
#define INIT_THREAD_PRIO DEFAULT_THREAD_PRIO

/*! @brief Stack size of the thread which prints DHCP info. */
#define PRINT_THREAD_STACKSIZE 512

/*! @brief Priority of the thread which prints DHCP info. */
#define PRINT_THREAD_PRIO DEFAULT_THREAD_PRIO

/*! @brief Selection of GPIO perihperal and its pin for the reception of PHY interrupts. */
#if ETH_LINK_POLLING_INTERVAL_MS == 0
#ifndef EXAMPLE_PHY_INT_PORT
#if (!defined(BOARD_NETWORK_USE_100M_ENET_PORT) || !BOARD_NETWORK_USE_100M_ENET_PORT) && \
    defined(BOARD_INITENET1GPINS_PHY_INTR_PERIPHERAL)
#define EXAMPLE_PHY_INT_PORT BOARD_INITENET1GPINS_PHY_INTR_PERIPHERAL
#elif defined(BOARD_INITENETPINS_PHY_INTR_PERIPHERAL)
#define EXAMPLE_PHY_INT_PORT BOARD_INITENETPINS_PHY_INTR_PERIPHERAL
#elif defined(BOARD_INITPINS_PHY_INTR_PERIPHERAL)
#define EXAMPLE_PHY_INT_PORT BOARD_INITPINS_PHY_INTR_PERIPHERAL
#else
#error "Interrupt-based link-state detection was enabled on an unsupported board."
#endif
#endif // #ifndef EXAMPLE_PHY_INT_PORT

#ifndef EXAMPLE_PHY_INT_PIN
#if (!defined(BOARD_NETWORK_USE_100M_ENET_PORT) || !BOARD_NETWORK_USE_100M_ENET_PORT) && \
    defined(BOARD_INITENET1GPINS_PHY_INTR_CHANNEL)
#define EXAMPLE_PHY_INT_PIN BOARD_INITENET1GPINS_PHY_INTR_CHANNEL
#elif defined(BOARD_INITENETPINS_PHY_INTR_CHANNEL)
#define EXAMPLE_PHY_INT_PIN BOARD_INITENETPINS_PHY_INTR_CHANNEL
#elif defined(BOARD_INITPINS_PHY_INTR_CHANNEL)
#define EXAMPLE_PHY_INT_PIN BOARD_INITPINS_PHY_INTR_CHANNEL
#else
#error "Interrupt-based link-state detection was enabled on an unsupported board."
#endif
#endif // #ifndef EXAMPLE_PHY_INT_PIN
#endif // #if ETH_LINK_POLLING_INTERVAL_MS == 0

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static void print_dhcp_state(void *arg);
void tcpipserver_task(void *pvParameters);
/*******************************************************************************
 * Variables
 ******************************************************************************/
static phy_handle_t phyHandle;
static netif_ext_callback_t linkStatusCallbackInfo;
#define MAX_CMD_LENGTH 2
#define MAX_TAGID_LENGTH 20
QueueHandle_t servo_queue = NULL;
QueueHandle_t database_queue = NULL;
EventGroupHandle_t tcpipEvent_group = NULL;
SemaphoreHandle_t xMutexPrintf;
/*******************************************************************************
 * Code
 ******************************************************************************/

/* MUTEX for PRINTF */
void MUTEX_PRINTF(const char *format, ...) {
	if (xMutexPrintf == NULL) {
		return;
	}
	if (xSemaphoreTake(xMutexPrintf, portMAX_DELAY) == pdTRUE) {
		va_list args;
		va_start(args, format);
		vprintf(format, args);
		va_end(args);
		fflush(stdout);
		xSemaphoreGive(xMutexPrintf);
	}
}

/*!
 * @brief Link status callback - prints link status events.
 */
static void linkStatusCallback(struct netif *netif_, netif_nsc_reason_t reason, const netif_ext_callback_args_t *args)
{
    if (reason != LWIP_NSC_LINK_CHANGED)
        return;

    //MUTEX_PRINTF("[LINK STATE] netif=%d, state=%s", netif_->num, args->link_changed.state ? "up" : "down");
    PRINTF("[LINK STATE] netif=%d, state=%s", netif_->num, args->link_changed.state ? "up" : "down");
    if (args->link_changed.state)
    {
        char *speedStr;
        switch (ethernetif_get_link_speed(netif_))
        {
            case kPHY_Speed10M:
                speedStr = "10M";
                break;
            case kPHY_Speed100M:
                speedStr = "100M";
                break;
            case kPHY_Speed1000M:
                speedStr = "1000M";
                break;
            default:
                speedStr = "N/A";
                break;
        }

        char *duplexStr;
        switch (ethernetif_get_link_duplex(netif_))
        {
            case kPHY_HalfDuplex:
                duplexStr = "half";
                break;
            case kPHY_FullDuplex:
                duplexStr = "full";
                break;
            default:
                duplexStr = "N/A";
                break;
        }

        //MUTEX_PRINTF(", speed=%s_%s", speedStr, duplexStr);
        PRINTF(", speed=%s_%s", speedStr, duplexStr);
    }

    //MUTEX_PRINTF("\r\n");
    PRINTF("\r\n");
}

/*!
 * @brief Initializes lwIP stack.
 *
 * @param arg unused
 */
static void stack_init(void *arg)
{
    static struct netif netif;
    ethernetif_config_t enet_config = {
        .phyHandle   = &phyHandle,
        .phyAddr     = EXAMPLE_PHY_ADDRESS,
        .phyOps      = EXAMPLE_PHY_OPS,
        .phyResource = EXAMPLE_PHY_RESOURCE,
        .srcClockHz  = EXAMPLE_CLOCK_FREQ,
#ifdef configMAC_ADDR
        .macAddress = configMAC_ADDR,
#endif
#if ETH_LINK_POLLING_INTERVAL_MS == 0
        .phyIntGpio    = EXAMPLE_PHY_INT_PORT,
        .phyIntGpioPin = EXAMPLE_PHY_INT_PIN
#endif
    };

    LWIP_UNUSED_ARG(arg);

    /* Set MAC address. */
#ifndef configMAC_ADDR
    (void)SILICONID_ConvertToMacAddr(&enet_config.macAddress);
#endif

    HAL_GpioPreInit();

    tcpip_init(NULL, NULL);

    LOCK_TCPIP_CORE();
    netif_add_ext_callback(&linkStatusCallbackInfo, linkStatusCallback);
    UNLOCK_TCPIP_CORE();

    netifapi_netif_add(&netif, NULL, NULL, NULL, &enet_config, EXAMPLE_NETIF_INIT_FN, tcpip_input);
    netifapi_netif_set_default(&netif);
    netifapi_netif_set_up(&netif);

   // while (ethernetif_wait_linkup(&netif, 5000) != ERR_OK)
   // {
    	//MUTEX_PRINTF("PHY Auto-negotiation failed. Please check the cable connection and link partner setting.\r\n");
       // PRINTF("PHY Auto-negotiation failed. Please check the cable connection and link partner setting.\r\n");
   // }
    xEventGroupSetBits(tcpipEvent_group, 0x01); 

    netifapi_dhcp_start(&netif);

    //MUTEX_PRINTF("\r\n************************************************\r\n");
    //MUTEX_PRINTF(" DHCP example\r\n");
    //MUTEX_PRINTF("************************************************\r\n");

    PRINTF("\r\n************************************************\r\n");
    PRINTF(" DHCP example\r\n");
    PRINTF("************************************************\r\n");

    if (sys_thread_new("print_dhcp", print_dhcp_state, &netif, PRINT_THREAD_STACKSIZE, PRINT_THREAD_PRIO) == NULL)
    {
        LWIP_ASSERT("stack_init(): Task creation failed.", 0);
    }

    vTaskDelete(NULL);
}

/*!
 * @brief Prints DHCP status of the interface when it has changed from last status.
 *
 * @param arg pointer to network interface structure
 */
static void print_dhcp_state(void *arg)
{
    struct netif *netif = (struct netif *)arg;
    struct dhcp *dhcp;
    u8_t dhcp_last_state = DHCP_STATE_OFF;

    while (netif_is_up(netif))
    {
        dhcp = netif_dhcp_data(netif);

        if (dhcp == NULL)
        {
            dhcp_last_state = DHCP_STATE_OFF;
        }
        else if (dhcp_last_state != dhcp->state)
        {
            dhcp_last_state = dhcp->state;

            //MUTEX_PRINTF(" DHCP state       : ");
            PRINTF(" DHCP state       : ");
            switch (dhcp_last_state)
            {
                case DHCP_STATE_OFF:
                    //MUTEX_PRINTF("OFF");
                    PRINTF("OFF");
                    break;
                case DHCP_STATE_REQUESTING:
                    //MUTEX_PRINTF("REQUESTING");
                    PRINTF("REQUESTING");
                    break;
                case DHCP_STATE_INIT:
                    //MUTEX_PRINTF("INIT");
                    PRINTF("INIT");
                    break;
                case DHCP_STATE_REBOOTING:
                    //MUTEX_PRINTF("REBOOTING");
                    PRINTF("REBOOTING");
                    break;
                case DHCP_STATE_REBINDING:
                    //MUTEX_PRINTF("REBINDING");
                    PRINTF("REBINDING");
                    break;
                case DHCP_STATE_RENEWING:
                    //MUTEX_PRINTF("RENEWING");
                    PRINTF("RENEWING");
                    break;
                case DHCP_STATE_SELECTING:
                    //MUTEX_PRINTF("SELECTING");
                    PRINTF("SELECTING");
                    break;
                case DHCP_STATE_INFORMING:
                    //MUTEX_PRINTF("INFORMING");
                    PRINTF("INFORMING");
                    break;
                case DHCP_STATE_CHECKING:
                    //MUTEX_PRINTF("CHECKING");
                    PRINTF("CHECKING");
                    break;
                case DHCP_STATE_BOUND:
                    //MUTEX_PRINTF("BOUND");
                    PRINTF("BOUND");
                    break;
                case DHCP_STATE_BACKING_OFF:
                    //MUTEX_PRINTF("BACKING_OFF");
                    PRINTF("BACKING_OFF");
                    break;
                default:
                    //MUTEX_PRINTF("%u", dhcp_last_state);
                    PRINTF("%u", dhcp_last_state);
                    assert(0);
                    break;
            }
            //MUTEX_PRINTF("\r\n");
            PRINTF("\r\n");

            if (dhcp_last_state == DHCP_STATE_BOUND)
            {
            	//MUTEX_PRINTF("\r\n IPv4 Address     : %s\r\n", ipaddr_ntoa(&netif->ip_addr));
            	//MUTEX_PRINTF(" IPv4 Subnet mask : %s\r\n", ipaddr_ntoa(&netif->netmask));
            	//MUTEX_PRINTF(" IPv4 Gateway     : %s\r\n\r\n", ipaddr_ntoa(&netif->gw));
                PRINTF("\r\n IPv4 Address     : %s\r\n", ipaddr_ntoa(&netif->ip_addr));
            	PRINTF(" IPv4 Subnet mask : %s\r\n", ipaddr_ntoa(&netif->netmask));
            	PRINTF(" IPv4 Gateway     : %s\r\n\r\n", ipaddr_ntoa(&netif->gw));
                //TODO DSOAE Set TCPIP event bit
                //TODO DSOAE TCPIP event bit
                xEventGroupSetBits(tcpipEvent_group, 0x01);
            }
        }

        sys_msleep(20U);
    }

    vTaskDelete(NULL);
}

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*!
 * @brief host callback function.
 *
 * device attach/detach callback function.
 *
 * @param deviceHandle          device handle.
 * @param configurationHandle   attached device's configuration descriptor information.
 * @param eventCode             callback event code, please reference to enumeration host_event_t.
 *
 * @retval kStatus_USB_Success              The host is initialized successfully.
 * @retval kStatus_USB_NotSupported         The application don't support the configuration.
 */
static usb_status_t USB_HostEvent(usb_device_handle deviceHandle,
                                  usb_host_configuration_handle configurationHandle,
                                  uint32_t eventCode);

/*!
 * @brief application initialization.
 */
static void USB_HostApplicationInit(void);

/*!
 * @brief host freertos task function.
 *
 * @param g_HostHandle   host handle
 */
static void USB_HostTask(void *param);

/*!
 * @brief host keybaord freertos task function.
 *
 * @param param   the host keybaord instance pointer.
 */
static void USB_HostApplicationKeyboardTask(void *param);

extern void USB_HostClockInit(void);
extern void USB_HostIsrEnable(void);
extern void USB_HostTaskFn(void *param);
void BOARD_InitHardware(void);

/*******************************************************************************
 * Variables
 ******************************************************************************/
/*! @brief USB host keyboard instance global variable */
extern usb_host_keyboard_instance_t g_HostHidKeyboard;
usb_host_handle g_HostHandle;

/*******************************************************************************
 * Code
 ******************************************************************************/

/*!
 * @brief USB isr function.
 */

static usb_status_t USB_HostEvent(usb_device_handle deviceHandle,
                                  usb_host_configuration_handle configurationHandle,
                                  uint32_t eventCode)
{
    usb_status_t status1;
    usb_status_t status2;
    usb_status_t status = kStatus_USB_Success;

    switch (eventCode & 0x0000FFFFU)
    {
        case kUSB_HostEventAttach:
            status1 = USB_HostHidKeyboardEvent(deviceHandle, configurationHandle, eventCode);
            if (status1 == kStatus_USB_NotSupported)
            {
                status = kStatus_USB_NotSupported;
            }
            break;

        case kUSB_HostEventNotSupported:
            usb_echo("device not supported.\r\n");
            //MUTEX_PRINTF("device not supported.\r\n");
            break;

        case kUSB_HostEventEnumerationDone:
            status1 = USB_HostHidKeyboardEvent(deviceHandle, configurationHandle, eventCode);
            if (status1 != kStatus_USB_Success)
            {
                status = kStatus_USB_Error;
            }
            break;

        case kUSB_HostEventDetach:
            status1 = USB_HostHidKeyboardEvent(deviceHandle, configurationHandle, eventCode);
            if (status1 != kStatus_USB_Success)
            {
                status = kStatus_USB_Error;
            }
            break;

        case kUSB_HostEventEnumerationFail:
            usb_echo("enumeration failed\r\n");
            //MUTEX_PRINTF("enumeration failed\r\n");
            break;

        default:
            break;
    }
    return status;
}

static void USB_HostApplicationInit(void)
{
    usb_status_t status = kStatus_USB_Success;

    USB_HostClockInit();

#if ((defined FSL_FEATURE_SOC_SYSMPU_COUNT) && (FSL_FEATURE_SOC_SYSMPU_COUNT))
    SYSMPU_Enable(SYSMPU, 0);
#endif /* FSL_FEATURE_SOC_SYSMPU_COUNT */

    status = USB_HostInit(CONTROLLER_ID, &g_HostHandle, USB_HostEvent);
    if (status != kStatus_USB_Success)
    {
        usb_echo("host init error\r\n");
        //MUTEX_PRINTF("host init error\r\n");
        return;
    }
    USB_HostIsrEnable();

    usb_echo("host init done\r\n");
    //MUTEX_PRINTF("host init done\r\n");
}

static void USB_HostTask(void *param)
{
    while (1)
    {
        USB_HostTaskFn(param);
    }
}

static void USB_HostApplicationKeyboardTask(void *param)
{
    while (1)
    {
        USB_HostHidKeyboardTask(param);
    }
}

int main(void)
{
    BOARD_InitHardware();

    LED_GREEN_INIT(LOGIC_LED_OFF);
    LED_RED_INIT(LOGIC_LED_OFF);
    LED_BLUE_INIT(LOGIC_LED_ON);

	//RTOS objects needed to be started before the scheduler:
	servo_queue = xQueueCreate(10, MAX_CMD_LENGTH);
	database_queue = xQueueCreate(10, MAX_TAGID_LENGTH);
	tcpipEvent_group = xEventGroupCreate();

    USB_HostApplicationInit();

    xMutexPrintf = xSemaphoreCreateMutex();

    /* Initialize lwIP from thread */
    if (sys_thread_new("main", stack_init, NULL, INIT_THREAD_STACKSIZE, 5) == NULL)
    {
        LWIP_ASSERT("main(): Task creation failed.", 0);
    }

    if (xTaskCreate(USB_HostTask, "usb host task", 2000L / sizeof(portSTACK_TYPE), g_HostHandle, 4, NULL) != pdPASS)
    {
    	//MUTEX_PRINTF("create host task error\r\n");
        PRINTF("create host task error\r\n");
    }

    if (xTaskCreate(USB_HostApplicationKeyboardTask, "keyboard task", 2000L / sizeof(portSTACK_TYPE),&g_HostHidKeyboard, 3, NULL) != pdPASS)
    {
    	//MUTEX_PRINTF("create mouse task error\r\n");
        PRINTF("create mouse task error\r\n");
    }

    if (xTaskCreate(tcpipserver_task, "tcpipserver_task", 2000L / sizeof(portSTACK_TYPE), NULL, 3, NULL) != pdPASS)
    {
    	//MUTEX_PRINTF("create host task error\r\n");
        PRINTF("create host task error\r\n");
    }

    if (xTaskCreate(servo_task, "Servo task", 2000L / sizeof(portSTACK_TYPE), NULL, 3, NULL) != pdPASS)
    {
    	//MUTEX_PRINTF("create host task error\r\n");
        PRINTF("create host task error\r\n");
    }

    if (xTaskCreate(database_task, "Database task", 3000L / sizeof(portSTACK_TYPE), NULL, 3, NULL) != pdPASS)
    {
    	//MUTEX_PRINTF("create host task error\r\n");
        PRINTF("create host task error\r\n");
    }

    vTaskStartScheduler();

    while (1)
    {
        ;
    }
}
